function getRandomElement(array: string[]) {
    return array[Math.floor(Math.random() * array.length)];
}

function generateRandomChance() {
    return Math.random() < 0.5 ? 2 : 1;
}

const ukraineShopNames = [
    "Продукти 24/7",
    "Еко-Маркет",
    "Техніка-Центр",
    "Одяг та Мода",
    "Фермерський Ринок",
    "Аптека Здоров'я",
    "Електроніка Експрес",
    "Книжковий Світ",
    "Фруктова Лавка",
    "Спортивний Універмаг",
    "Будмаркет",
    "Кав'ярня Ласунка",
    "Меблі та Декор",
    "Автозапчастини Швидко",
    "Косметичний Король",
    "М'ясна Гастрономія",
    "Магазин Технічних Іграшок",
    "Дитячий Світ Забав",
    "Авторські Шоколадки",
    "Ігрова Студія",
    "Будинок Ремесел",
    "Благодійний Базар",
    "Фото-Хобі Магазин",
    "Теплі Руки - Рукоділля",
    "Смак Групи Сиру",
    "Тренажерний Центр",
    "Магазин Подорожей",
    "Еклектичний Благословення",
    "Оптика Витрина",
    "Будь-Яка Кава",
    "Автомагазин Вершина",
    "Весільний Салон",
    "Магія Зелених Рослин",
    "Комп'ютерний Простір",
    "Магазин Спецій і Смаків",
    "Стильна Гардеробна",
    "Гірськолижний Магазин",
    "Біжутерія Чарівниця",
    "Вінні Смачний",
    "Інструментальний Світ",
    "Культурний Магазин",
    "Багетна Майстерня",
    "Експлорерський Одяг",
    "Магазин Шукань",
    "Природний Косметичний",
    "Столова Книга",
];

export default function GenerateNewTransactionHistory(){
    return { author: getRandomElement(ukraineShopNames), typeOfTransfer: generateRandomChance() === 1 ? 'incoming' : 'outgoing', text: (Math.random() * (100000 - 3) + 3).toFixed(2) }
}