const Regular = [
    'Яка комісія за платежі в інший банк у неопераційний час?',
    'Які операції не здійснюються у вихідні та святкові дні?',
    'Чи можна за рахунок online-інкасації в суботу погасити кредит у той самий день?',
    'Чи можна розмістити депозит у вихідний день та отримати за ним дохід?',
    'Чи можна погасити кредит у суботу та не платити процентів за вихідні дні?',
    'Чи можу я провести оплату на рахунок, відкритий у ПриватБанку, у вихідний день?',
    'Чи можу я здійснити оплату на рахунок, відкритий в іншому банку, у неробочий час?'
]

export function CheckQARegular(inputData: string){
  return Regular.includes(inputData) ? true : false;
}

export const q_a = [
    [
      {
        text: 'Яка комісія за платежі в інший банк у неопераційний час?'
      }
    ],
    [
      {
        text: 'Які операції не здійснюються у вихідні та святкові дні?'
      }
    ],
    [
      {
        text: 'Чи можна за рахунок online-інкасації в суботу погасити кредит у той самий день?'
      }
    ],
    [
      {
        text: 'Чи можна розмістити депозит у вихідний день та отримати за ним дохід?'
      }
    ],
    [
      {
        text: 'Чи можу я провести оплату на рахунок, відкритий у ПриватБанку, у вихідний день?'
      }
    ],
    [
      {
        text: 'Чи можна погасити кредит у суботу та не платити процентів за вихідні дні?'
      }
    ],
    [
      {
        text: 'Чи можу я здійснити оплату на рахунок, відкритий в іншому банку, у неробочий час?'
      }
    ],
    [
      {
        text: 'В МЕНЮ'
      }
    ]
  ]

export const q_aAnswers = {
    'Яка комісія за платежі в інший банк у неопераційний час?': `Скасовано додаткову комісію, що становила 0,2% від суми платежу на рахунки в інших банках в післяопераційний час (після 16:30).`,

    'Які операції не здійснюються у вихідні та святкові дні?': `У вихідні та святкові дні не здійснюються такі операції:
- міжнародні перекази, якщо банк-кореспондент не працює в ці дні;
- валютно-обмінні операції корпоративних клієнтів, обмежені часом торгової сесії;`,

    'Чи можна за рахунок online-інкасації в суботу погасити кредит у той самий день?': `Так, online-інкасація зараховується в суботу, і на рахунку клієнта будуть кошти для погашення кредиту.`,

    'Чи можна розмістити депозит у вихідний день та отримати за ним дохід?': `Так, якщо депозит розміщено в суботу, він відобразиться у виписці в той самий день, і вже за неділю клієнт зможе отримати дохід.`,

    'Чи можу я провести оплату на рахунок, відкритий у ПриватБанку, у вихідний день?': `Так. Платежі на рахунки в ПриватБанку проводяться цілодобово та без вихідних.`,

    'Чи можна погасити кредит у суботу та не платити процентів за вихідні дні?': `Так, погашення кредиту в суботу відбувається за випискою в той самий день і дозволяє не платити процентів за вихідні дні.`,

    'Чи можу я здійснити оплату на рахунок, відкритий в іншому банку, у неробочий час?': `Так. У робочі дні платежі можна надіслати з 06:00 до 24:00. У вихідні та святкові дні – за регламентом НБУ першого робочого дня після вихідних.`
} as {[key: string] : string}