const Regular = [
    'скільки разів на тиждень можна займатися',
    'ціна та оплата',
    'різниця між груповими та індивідуальними',
    'який формат мені обрати',
    'скільки триває курс',
    'що робити, якщо пропустив заняття',
    'як проходить заняття'
]

export function CheckQARegular(inputData: string){
  return Regular.includes(inputData) ? true : false;
}

export const q_a = [
    [
      {
        text: 'скільки разів на тиждень можна займатися'
      }
    ],
    [
      {
        text: 'ціна та оплата'
      }
    ],
    [
      {
        text: 'різниця між груповими та індивідуальними'
      }
    ],
    [
      {
        text: 'який формат мені обрати'
      }
    ],
    [
      {
        text: 'скільки триває курс'
      }
    ],
    [
      {
        text: 'що робити, якщо пропустив заняття'
      }
    ],
    [
      {
        text: 'як проходить заняття'
      }
    ],
    [
      {
        text: 'В МЕНЮ'
      }
    ]
  ]

export const q_aAnswers = {
    'скільки разів на тиждень можна займатися': `Планувати можна різну кількість занять на тиждень, відштовхуючись від вашого графіку та графіку викладача.
Ми, у свою чергу, рекомендуємо планувати по 2 занятті на тиждень.`,

    'ціна та оплата': `Оплатити заняття можна у декілька способів:
👉 написати нам в соцмережі
👉 тут у телеграм-боті.
Оплатити можна або комплексний пакет індивідуальних / групових занять (включає 8 занять), або ж оплачувати кожне заняття окремо. 
‼️ Слід зауважити, що оплата кожного пакету занять проходить після проведення усіх 8 занять,без привязки до місяця.`,

    'різниця між груповими та індивідуальними': `Ключова різниця між індивідуальними та груповими заняттями лише у кількості людей, оскільки група складається з 2-4 людей. 
👉 Індивідульні заняття тривають до 60 хв
👉 Групові до 80хв
‼ Ми зберігаємо однаковий підхід при проведенні групових  індивідуальних занять`,

    'який формат мені обрати': `Усе залежить від особистих вподобань: якщо ви переважно інтроверт або хочете усю увагу викладача виключно собі, то найкраще підійдуть індивідуальні, а для тих, хто не бачить свого життя без кола нових знайомств, то вибір очевидний - групові. 
‼ Окрім того, якщо ви повний бегінер, то ми рекомендуємо почати з індивідуальних `,

    'скільки триває курс': `Орієнтовна тривалість курсу становить 1,5 року. 
Чому орієнтовна? Все тому, що темп навчання у кожного індивідуальний, тому хтось може впоратись раніше, а у когось навчання може затягнутися на довше.`,

    'що робити, якщо пропустив заняття': `Пропущене заняття залишається за вами і може бути проведено у зручний час або по графіку, якщо воно було пропущено з нашої вини або якщо студент  попередив викладача щонайменше за 5 хв до початку, в іншому випадку заняття зараховується як проведене. 
‼ Будь-які форс-мажорні пропуски занять без попереджень обговорються в індивідуальному порядку`,

    'як проходить заняття': `👉 Кожне заняття починається з короткого greeting, типу “як справи?”, “що цікавого?”\n
👉 Далі відбувається просте пояснення граматики “на пальцях”    
    + закріплення на вправах. Одну тему можемо практикувати від 2 до, навіть, 8 уроків, щоб бути впевненим у розмові\n
👉 Наступна частина - speaking, проходить у форматі діалогу; ми обговорюємо різні теми, додаючи слова та вирази по рівню. Мета - навчитися підтримувати будь-яку розмову\n
👉 Фінальною частиною є вправа на слух. Дивимося короткі уривки із різних серіалів.
Це працює як ніби ми налаштовуємо слух на потрібну частоту та вчимося сприймати усі тонкощі вимови носіїв`
} as {[key: string] : string}