const script = {

  entire: {
    greeting: `Привіт😊 Вас вітає чат бот банку "ПриватБанк"? Підкажіть, будь ласка, як можна до Вас звертатися?`,
    thanksOnStart: (name : string) => `Дуже приємно, ${name}🤗`,
    phoneRequire: `Тепер, будь ласка, нам потрібен ваш номер телефону, щоб ми могли індетифікувати вас і вашу карту`,
    thanksForComplet: (card : number) => `Дуже вдячні Вам 💙\n\nВаш номер картки - ${card}.`,
    functionEntire: `Тепер, будь ласка, оберіть функцію якою б хотіли скористатися`
  },

  error: {
    errorExceptionFunction: `Ой, халепа... Щось пішло не так...😬\nСпробуйте, будь ласка, скористатися кнопками нижче для вибору функції! ⬇️`,
    buttonError: `От халепа... \n\nБудь ласка, оберіть кнопку нижче ⬇️`,
    classicTextError: `Ого-го... щиро дякуємо, але вам потрібно просто написати, нічого більше :)`,
    paymentError: `Ой.. лишенько.. \n\nВам потрібно завантажити скрін з галереї або надіслати файл (підтримовані формати: pdf, jpeg, jpg, png, heic)`,
    phoneError: `Ой-ой... вам потрібно натиснути внизу на кнопку “Поділитися номером”`
  },

  values: {
    entire: `Чудесно, тепер оберіть конекретніше, що вам саме потрібно`,

    valueData: (name: string, value: string, code: string) => 
    `${name} - ${value} ${code.toLocaleLowerCase()}.`
  }

}

export default script;

//✅ пакет “${packetName}”//